In [107]:
import pandas as pd
import numpy as np

In [108]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky', ''],'Age':[28,34,29,42,np.nan]}
df = pd.DataFrame(data)

In [109]:
df.dtypes

Name     object
Age     float64
dtype: object

### Dataframe Basics

#### Return the shape of the dataframe

In [110]:
df.shape

(5, 2)

This is a tuple so if we want the number of rows...

In [111]:
df.shape[0]

5

Or if we want the number of columns

In [112]:
df.shape[1]

2

### Indexing

### Concatenating Data

#### Return a dataframe which is the combination of a dataframe and a series, series and a series, or dataframe and a dataframe

In [113]:
series1 = pd.Series(data = [175, 200, 300, 150, ""], name='Weight')
df = pd.concat([df,series1], axis=1, sort=True)

In [114]:
df

    Name   Age Weight
0    Tom  28.0    175
1   Jack  34.0    200
2  Steve  29.0    300
3  Ricky  42.0    150
4          NaN

### Boolean Indexing (Using conditional statements)

#### Get count of boolean returning true given condition in parentheses

In [4]:
np.sum(df.Age > 35)

1

This works because...

In [6]:
print(1*True, 1*False)

1 0

In other words, false is stored as the boolean value 0 and true as the boolean value 1

#### Return data for which conditional statement using boolean index is true

In [13]:
df[df.Age > 30]

        Name  Age
rank2   Jack   34
rank4  Ricky   42

#### Return specific columns for which the conditional statement using booolean index is true

In [14]:
df.Name[df.Age > 30]

rank2     Jack
rank4    Ricky
Name: Name, dtype: object

#### Return the proportion of observations matching some conditional statement criteria

In [16]:
np.sum(df.Age > 30)/df.shape[0]

0.5

This returns the correct float value here but in python 2 this would return 0. This is because in most other languages when dividing integers by integers or floats by integers and vice versa, it interprets the divided number in integer form. Thus since 0.5 is less than 1 it would return 0. If the true return float would be 1.5 the python 2 version would have been 1. In order to avoid this in python 2 we must make sure that both of the types of the values being divided are floats!

We can also use an easier method to get this proportion that works in both version 2 and 3

In [22]:
np.mean(df.Age > 30)

0.5

Or using a direct method using just pandas..

In [24]:
(df.Age > 30).mean()

0.5

### Filtering

We can think of filtering as performing boolean indexing with 2 or more conditional statements

In [78]:
df[(df.Age > 30) & (df.Weight > 160)]

   index  Name  Age  Weight
1  rank2  Jack   34     200

### Cleaning a Dataset

#### Removing Null values

Using the "isnull" method we see can which columns or rows have NaN values. However, this method does not capture missing or None values. IE it doesnt capture empty cells or cells with "None".

In [102]:
df[df.Age.isnull()]

  Name  Age Weight
4       NaN

Here we see that using isnull with the "Name" column does not return any rows. Even though there is an empty cell is the "Name" column.

In [104]:
df[df.Name.isnull()]

Empty DataFrame
Columns: [Name, Age, Weight]
Index: []

Either way we can drop the row with the NaN by calling by boolean indexing using the notnull method on the Age column

In [105]:
df = df[df.Age.notnull()]

In [106]:
df

    Name   Age Weight
0    Tom  28.0    175
1   Jack  34.0    200
2  Steve  29.0    300
3  Ricky  42.0    150